In [1]:
import pandas as pd
df = pd.read_csv('associado.csv')

In [3]:
import sqlite3
# Create your connection.
cnx = sqlite3.connect('associado.db')

In [4]:
df.to_sql('associado', index=False, con=cnx)

199

In [6]:
pd.read_sql('select * from associado', con=cnx)

      id        nome     sobrenome  idade                 email
0      1    cliente1    sobrenome1     22    cliente1@email.com
1      2    cliente2    sobrenome2     41    cliente2@email.com
2      3    cliente3    sobrenome3     80    cliente3@email.com
3      4    cliente4    sobrenome4     48    cliente4@email.com
4      5    cliente5    sobrenome5     20    cliente5@email.com
..   ...         ...           ...    ...                   ...
194  195  cliente195  sobrenome195     39  cliente195@email.com
195  196  cliente196  sobrenome196     52  cliente196@email.com
196  197  cliente197  sobrenome197     28  cliente197@email.com
197  198  cliente198  sobrenome198     22  cliente198@email.com
198  199  cliente199  sobrenome199     57  cliente199@email.com

[199 rows x 5 columns]

In [13]:
df = pd.read_csv('cartao.csv')

In [14]:
df

      id   num_cartao  nom_impresso  id_conta  id_associado
0      1  45362117086           NaN        33           103
1      2  71600523487           NaN       160           101
2      3  46016682819           NaN       155            60
3      4  67015736695           NaN       213           190
4      5  81192832431           NaN        40           114
..   ...          ...           ...       ...           ...
283  284  73021062041           NaN        75            70
284  285  54150460402           NaN       185           176
285  286  64494953936           NaN        29            38
286  287  73731978965           NaN       244             1
287  288  47887195670           NaN       177           149

[288 rows x 5 columns]

In [6]:
df['nom_impresso'] = 'cliente' + df['id_associado'].astype(str)

In [ ]:
import numpy as np
# Definir o intervalo de datas
data_inicio = '2024-01-01'
data_fim = '2024-07-31'

# Gerar timestamps aleatórios
num_registros = 288  # Quantidade de timestamps desejada

# Converter para datetime64[ns]
start = pd.to_datetime(data_inicio)
end = pd.to_datetime(data_fim)

# Gerar timestamps aleatórios usando numpy
random_timestamps = pd.to_datetime(
    np.random.randint(
        start.value,  # Valor em nanossegundos
        end.value, 
        size=num_registros
    )
)

# Criar DataFrame
random_timestamps

# Formatar a exibição (opcional)
#df['timestamp_aleatorio'] = df['timestamp_aleatorio'].dt.strftime('%Y-%m-%d %H:%M:%S')

In [7]:
df['data_criacao'] =

      id   num_cartao nom_impresso  id_conta  id_associado
0      1  45362117086   cliente103        33           103
1      2  71600523487   cliente101       160           101
2      3  46016682819    cliente60       155            60
3      4  67015736695   cliente190       213           190
4      5  81192832431   cliente114        40           114
..   ...          ...          ...       ...           ...
283  284  73021062041    cliente70        75            70
284  285  54150460402   cliente176       185           176
285  286  64494953936    cliente38        29            38
286  287  73731978965     cliente1       244             1
287  288  47887195670   cliente149       177           149

[288 rows x 5 columns]

In [12]:
df.to_json('cartao.json',index=False)

In [9]:
import pandas as pd
df = pd.read_csv('conta.csv')

In [12]:
df.data_criacao.min()

'01/01/2024'

In [22]:

df.to_xml('conta.xml',index=False)